results/1k-gateway.txt
/ # wrk -t 4 -c 50 -d 30s -R 1000 --latency -s /req-body.lua http://localhost:9080/v1/chat
/completions
Running 30s test @ http://localhost:9080/v1/chat/completions
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.521ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.433ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.537ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.551ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.62ms    1.31ms  26.14ms   95.41%
    Req/Sec   262.81     87.05   777.00     81.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43ms
 75.000%    1.76ms
 90.000%    2.24ms
 99.000%    6.31ms
 99.900%   21.09ms
 99.990%   25.81ms
 99.999%   26.16ms
100.000%   26.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.417     0.000000            1         1.00
       0.857     0.100000         1999         1.11
       1.036     0.200000         3988         1.25
       1.179     0.300000         5981         1.43
       1.305     0.400000         7980         1.67
       1.427     0.500000         9968         2.00
       1.487     0.550000        10976         2.22
       1.546     0.600000        11970         2.50
       1.606     0.650000        12961         2.86
       1.678     0.700000        13958         3.33
       1.760     0.750000        14961         4.00
       1.810     0.775000        15449         4.44
       1.872     0.800000        15948         5.00
       1.937     0.825000        16448         5.71
       2.013     0.850000        16944         6.67
       2.113     0.875000        17445         8.00
       2.173     0.887500        17695         8.89
       2.245     0.900000        17948        10.00
       2.323     0.912500        18189        11.43
       2.437     0.925000        18440        13.33
       2.599     0.937500        18690        16.00
       2.707     0.943750        18813        17.78
       2.823     0.950000        18938        20.00
       2.983     0.956250        19062        22.86
       3.223     0.962500        19186        26.67
       3.601     0.968750        19311        32.00
       3.883     0.971875        19374        35.56
       4.191     0.975000        19435        40.00
       4.555     0.978125        19497        45.71
       4.887     0.981250        19560        53.33
       5.371     0.984375        19622        64.00
       5.627     0.985938        19653        71.11
       5.839     0.987500        19684        80.00
       6.091     0.989062        19715        91.43
       6.467     0.990625        19747       106.67
       6.767     0.992188        19779       128.00
       6.903     0.992969        19793       142.22
       7.099     0.993750        19809       160.00
       7.435     0.994531        19825       182.86
       7.719     0.995313        19840       213.33
       8.407     0.996094        19856       256.00
       9.615     0.996484        19863       284.44
      11.607     0.996875        19871       320.00
      13.679     0.997266        19879       365.71
      14.663     0.997656        19887       426.67
      16.959     0.998047        19895       512.00
      17.247     0.998242        19898       568.89
      18.063     0.998437        19902       640.00
      19.439     0.998633        19906       731.43
      20.351     0.998828        19910       853.33
      21.119     0.999023        19914      1024.00
      21.279     0.999121        19916      1137.78
      21.663     0.999219        19918      1280.00
      23.007     0.999316        19920      1462.86
      23.439     0.999414        19922      1706.67
      24.239     0.999512        19924      2048.00
      24.479     0.999561        19925      2275.56
      24.607     0.999609        19926      2560.00
      24.703     0.999658        19927      2925.71
      24.847     0.999707        19928      3413.33
      24.911     0.999756        19929      4096.00
      24.911     0.999780        19929      4551.11
      25.743     0.999805        19930      5120.00
      25.743     0.999829        19930      5851.43
      25.807     0.999854        19931      6826.67
      25.807     0.999878        19931      8192.00
      25.807     0.999890        19931      9102.22
      26.095     0.999902        19932     10240.00
      26.095     0.999915        19932     11702.86
      26.095     0.999927        19932     13653.33
      26.095     0.999939        19932     16384.00
      26.095     0.999945        19932     18204.44
      26.159     0.999951        19933     20480.00
      26.159     1.000000        19933          inf
#[Mean    =        1.620, StdDeviation   =        1.305]
#[Max     =       26.144, Total count    =        19933]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29993 requests in 30.00s, 14.33MB read
Requests/sec:    999.75
Transfer/sec:    489.13KB