results/20k-direct.txt
/ # wrk -t 4 -c 400 -d 60s -R 20000 --latency -s /req-body.lua http://localhost:1980/v1/ch
at/completions
Running 1m test @ http://localhost:1980/v1/chat/completions
  4 threads and 400 connections
  Thread calibration: mean lat.: 1.125ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.420ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.459ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.162ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.32ms  680.96us  12.54ms   72.65%
    Req/Sec     5.28k     2.00k   11.11k    63.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.68ms
 90.000%    2.10ms
 99.000%    3.42ms
 99.900%    5.92ms
 99.990%    9.13ms
 99.999%   10.67ms
100.000%   12.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.058     0.000000            1         1.00
       0.524     0.100000        99019         1.11
       0.749     0.200000       198270         1.25
       0.942     0.300000       297046         1.43
       1.115     0.400000       396044         1.67
       1.280     0.500000       495187         2.00
       1.359     0.550000       544877         2.22
       1.436     0.600000       594579         2.50
       1.514     0.650000       644095         2.86
       1.594     0.700000       693331         3.33
       1.682     0.750000       742745         4.00
       1.732     0.775000       767739         4.44
       1.786     0.800000       792238         5.00
       1.846     0.825000       817071         5.71
       1.916     0.850000       841795         6.67
       1.998     0.875000       866453         8.00
       2.045     0.887500       878627         8.89
       2.099     0.900000       891283        10.00
       2.159     0.912500       903625        11.43
       2.229     0.925000       915927        13.33
       2.315     0.937500       928280        16.00
       2.367     0.943750       934483        17.78
       2.425     0.950000       940623        20.00
       2.493     0.956250       946797        22.86
       2.575     0.962500       952927        26.67
       2.675     0.968750       959169        32.00
       2.733     0.971875       962218        35.56
       2.799     0.975000       965260        40.00
       2.879     0.978125       968388        45.71
       2.973     0.981250       971439        53.33
       3.097     0.984375       974560        64.00
       3.167     0.985938       976089        71.11
       3.251     0.987500       977625        80.00
       3.353     0.989062       979188        91.43
       3.475     0.990625       980739       106.67
       3.627     0.992188       982277       128.00
       3.715     0.992969       983050       142.22
       3.821     0.993750       983814       160.00
       3.943     0.994531       984597       182.86
       4.079     0.995313       985369       213.33
       4.263     0.996094       986139       256.00
       4.371     0.996484       986528       284.44
       4.507     0.996875       986921       320.00
       4.647     0.997266       987297       365.71
       4.835     0.997656       987686       426.67
       5.071     0.998047       988068       512.00
       5.207     0.998242       988266       568.89
       5.355     0.998437       988454       640.00
       5.523     0.998633       988649       731.43
       5.687     0.998828       988844       853.33
       5.943     0.999023       989037      1024.00
       6.067     0.999121       989134      1137.78
       6.215     0.999219       989230      1280.00
       6.359     0.999316       989330      1462.86
       6.531     0.999414       989420      1706.67
       6.791     0.999512       989521      2048.00
       6.939     0.999561       989567      2275.56
       7.079     0.999609       989614      2560.00
       7.199     0.999658       989663      2925.71
       7.347     0.999707       989711      3413.33
       7.583     0.999756       989760      4096.00
       7.707     0.999780       989783      4551.11
       7.823     0.999805       989807      5120.00
       8.075     0.999829       989831      5851.43
       8.391     0.999854       989855      6826.67
       8.815     0.999878       989880      8192.00
       9.007     0.999890       989892      9102.22
       9.199     0.999902       989904     10240.00
       9.279     0.999915       989918     11702.86
       9.367     0.999927       989930     13653.33
       9.591     0.999939       989940     16384.00
       9.679     0.999945       989947     18204.44
       9.735     0.999951       989954     20480.00
       9.823     0.999957       989958     23405.71
       9.903     0.999963       989964     27306.67
      10.023     0.999969       989970     32768.00
      10.063     0.999973       989973     36408.89
      10.143     0.999976       989977     40960.00
      10.183     0.999979       989979     46811.43
      10.263     0.999982       989982     54613.33
      10.471     0.999985       989985     65536.00
      10.543     0.999986       989987     72817.78
      10.591     0.999988       989988     81920.00
      10.671     0.999989       989990     93622.86
      10.727     0.999991       989991    109226.67
      12.311     0.999992       989993    131072.00
      12.351     0.999993       989994    145635.56
      12.351     0.999994       989994    163840.00
      12.407     0.999995       989995    187245.71
      12.431     0.999995       989997    218453.33
      12.431     0.999996       989997    262144.00
      12.431     0.999997       989997    291271.11
      12.431     0.999997       989997    327680.00
      12.471     0.999997       989998    374491.43
      12.471     0.999998       989998    436906.67
      12.511     0.999998       989999    524288.00
      12.511     0.999998       989999    582542.22
      12.511     0.999998       989999    655360.00
      12.511     0.999999       989999    748982.86
      12.511     0.999999       989999    873813.33
      12.543     0.999999       990000   1048576.00
      12.543     1.000000       990000          inf
#[Mean    =        1.324, StdDeviation   =        0.681]
#[Max     =       12.536, Total count    =       990000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1187614 requests in 1.00m, 540.25MB read
Requests/sec:  19793.07
Transfer/sec:      9.00MB